# Category Properties (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
Category Properties
Category Class See Also
---
The Category type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AllowsBoundParameters | To check if the category can have project parameters. |
| AllowsVisibilityControl | Whether the visibility can be controlled by the user for this category in this view. |
| BuiltInCategory | Gets the BuiltInCategory value for this category. |
| CanAddSubcategory | Indicates if subcategories can be assigned to the category. |
| CategoryType | Gets the category type of this category. |
| HasMaterialQuantities | Identifies if elements of the category are able to report what materials they contain in what quantities. |
| Id | Returns the category id associated with the category object. |
| IsCuttable | Indicates if the category is cuttable or not. |
| IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
| IsTagCategory | Identifies if the category is associated with a type of tag for a different category. |
| IsVisibleInUI | Identifies if the category is visible to the user and should be displayed in UI. |
| LineColor | The color of lines shown for elements of this category. |
| Material | Retrieves or changes the material of the category. |
| Name | The category name. |
| Parent | Returns the parent category of this category. |
| SubCategories | Returns a map containing all of the subcategories of this category. |
| Visible | Retrieves or changes the visibility of the category in the active view. |

# See Also
Category Class
Autodesk.Revit.DB Namespace